In [2]:
import pandas as pd

df_sbj = pd.read_excel("Knowledge_Editing_Dataset/data/one_hop/df_one_hop_sbj.xlsx")
df_trex = pd.read_excel("Knowledge_Editing_Dataset/data/one_hop/df_imsi_trex.xlsx")

In [3]:
df_sbj.head()

,index,subject,subject_id,one_hop
0,0,Danielle Darrieux,Q234149,"singer,actor,Bois-le-Roi,film,film actor,Franc..."
1,1,Edwin of Northumbria,Q348955,"Kingdom of Bernicia,English,King of Northumbri..."
2,2,Toko Yasuda,Q7813654,"rock music,Blonde Redhead,musician,bass guitar..."
3,3,Autonomous University of Madrid,Q788091,"Coalition for Advancing Research Assessment,Co..."
4,4,Lyon,Q456,"Metropolis of Lyon,Guangzhou,Košice,Leipzig,Bi..."

In [4]:
df_trex.head()

,index,subject,subject_id,one_hop,TREx_id,trex_one_hop
0,4,Lyon,Q456,"Metropolis of Lyon,Guangzhou,Košice,Leipzig,Bi...",Q6709677,"United States of America,Oakland County"
1,15,Percy Snow,Q7167583,"American football player,Guangzhou,American fo...",Q333575,"member of the House of Lords,English,politicia..."
2,16,Saint Petersburg,Q656,"Oslo,Helsinki,Casablanca,Xi'an,Dushanbe,Sevast...",Q1197271,"Saint Petersburg,French"
3,18,Porsche 911,Q219357,"auto racing,Porsche",Q2104537,Porsche
4,33,Majorette,Q405033,NaN,Q531015,"Lyon,France"

In [6]:
from tqdm import tqdm

null_count = 0
different_count = 0
null_one_hop =0
null_trex_one_hop = 0


for i in range(len(df_trex)):
    trex_id = df_trex.loc[i, 'TREx_id']
    subject_id = df_trex.loc[i, 'subject_id']
    if pd.isna(trex_id):
        null_count += 1
    elif trex_id != subject_id:
        different_count += 1
    if pd.isna(df_trex.loc[i, 'one_hop']):
        null_one_hop += 1
    elif pd.isna(df_trex.loc[i, 'trex_one_hop']):
        #print(1)
        pass
    if pd.isna(df_trex.loc[i, 'trex_one_hop']):
        null_trex_one_hop += 1
        


print(f'Total null count is {null_count}')
print(f'Total different count is {different_count}')
print(f'Subject null count is {null_one_hop}')
print(f'trex null count is {null_trex_one_hop}')

Total null count is 0
Total different count is 2839
Subject null count is 261
trex null count is 159

In [7]:
for i in range(len(df_trex)):
    trex_id = df_trex.loc[i, 'TREx_id']
    subject_id = df_trex.loc[i, 'subject_id']
    trex_word = df_trex.loc[i, 'trex_one_hop']
    subject_word = df_trex.loc[i, 'one_hop']
    if not pd.isna(trex_id) and not pd.isna(trex_word) and (trex_id != subject_id):
        df_sbj.loc[i, 'subject_id'] = trex_id
        df_sbj.loc[i, 'one_hop'] = trex_word

In [8]:
df_sbj.head()

,index,subject,subject_id,one_hop
0,0,Danielle Darrieux,Q6709677,"United States of America,Oakland County"
1,1,Edwin of Northumbria,Q333575,"member of the House of Lords,English,politicia..."
2,2,Toko Yasuda,Q1197271,"Saint Petersburg,French"
3,3,Autonomous University of Madrid,Q2104537,Porsche
4,4,Lyon,Q531015,"Lyon,France"

In [10]:
len(df_sbj)

21919

In [11]:
df_sbj.to_excel('df_one_hop_sbj_last.xlsx', index = False)